scripts/load-test.yml
config:
  target: "http://localhost:3000"
  environments:
    production:
      target: "{{ $processEnvironment.TARGET_URL }}"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 100
      name: "Sustained load"
    - duration: 60
      arrivalRate: 500
      name: "High load"
    - duration: 30
      arrivalRate: 1000
      name: "Peak load (1000 req/s)"
    - duration: 60
      arrivalRate: 100
      name: "Cool down"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Matchmake flow (Redis-backed)"
    weight: 60
    flow:
      - post:
          url: "/api/game/matchmake"
          json:
            userId: "load-test-user-{{ $randomNumber(1, 10000) }}"
          expect:
            - statusCode: 401

  - name: "SSE game stream"
    weight: 10
    flow:
      - get:
          url: "/api/game/stream?gameId=load-test-game-{{ $randomNumber(1, 1000) }}"
          expect:
            - statusCode:
                - 200
                - 401
                - 404

  - name: "Leaderboard read"
    weight: 20
    flow:
      - get:
          url: "/api/leaderboard"
          expect:
            - statusCode: 200

  - name: "Bug random"
    weight: 10
    flow:
      - get:
          url: "/api/bugs/random"
          expect:
            - statusCode: 200